{"id":"ff757fb5-fa0c-4f6c-a75a-b9cac2a3f32f","updated_at":"2026-06-27T03:25:51.300Z","updated_by":"elastic","created_at":"2026-06-25T07:23:31.860Z","created_by":"elastic","name":"[VN-SOC R1] PowerShell Encoded Command Execution","tags":["VN-SOC-Lab","T1059.001","PowerShell","Execution"],"interval":"1m","enabled":true,"revision":4,"description":"Phát hiện process powershell.exe / pwsh.exe được tạo với tham số -EncodedCommand chứa payload Base64. Đây là kỹ thuật #1 trong T1059.001 PowerShell —bypass detection theo command-line text.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"24ecbff1-ea33-43e9-a410-fc946af24c8a","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1059","name":"Command and Scripting Interpreter","reference":"https://attack.mitre.org/techniques/T1059/","subtechnique":[{"id":"T1059.001","name":"PowerShell","reference":"https://attack.mitre.org/techniques/T1059/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["winlogbeat-*"],"query":"event.code: \"1\" AND\nwinlog.provider_name: \"Microsoft-Windows-Sysmon\" AND\nwinlog.event_data.Image.keyword: (\n  *\\\\powershell.exe OR\n  *\\\\pwsh.exe OR\n  *\\\\powershell_ise.exe\n) AND\nwinlog.event_data.CommandLine: (\n  *EncodedCommand* OR\n  *encodedcommand*\n)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
