{"id":"253bc7b2-ae55-4eec-b59a-9dae282ad01e","updated_at":"2026-07-01T15:17:43.587Z","updated_by":"elastic","created_at":"2026-07-01T15:17:43.587Z","created_by":"elastic","name":"[VN-SOC R11] Web Login Brute Force — Threshold","tags":["VN-SOC-Lab","CredentialAccess","T1110","Threshold","Web"],"interval":"1m","enabled":true,"revision":0,"description":"Threshold rule: same source.address hits /login.php more than 20 times in 5 minutes = brute-force attempt.","risk_score":73,"severity":"high","output_index":"","author":[],"false_positives":[],"from":"now-5m","rule_id":"31a4abb6-0856-4dff-8ddb-579d72e1851e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["dvwa-apache-*"],"query":"url.original : \"/login.php\" and http.request.method : \"POST\"","threshold":{"field":["source.address"],"value":20},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
