{"id":"f0e8d5e6-c0b9-4143-8deb-9f91a34f9420","updated_at":"2026-07-01T15:17:46.593Z","updated_by":"elastic","created_at":"2026-07-01T15:17:46.593Z","created_by":"elastic","name":"[VN-SOC R12] First-Seen Process Image on Endpoint (New Terms)","tags":["VN-SOC-Lab","Execution","T1204","NewTerms","Baseline"],"interval":"10m","enabled":true,"revision":0,"description":"New Terms rule: alert when a process image never seen before in last 14 days runs. Baseline drift = potential new tool / persistence artifact.","risk_score":47,"severity":"medium","output_index":"","author":[],"false_positives":[],"from":"now-15m","rule_id":"f5777a32-69b6-447f-ab07-b816ffd758ee","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"new_terms","query":"event.code : \"1\" and winlog.provider_name : \"Microsoft-Windows-Sysmon\"","new_terms_fields":["winlog.event_data.Image.keyword"],"history_window_start":"now-14d","index":["winlogbeat-*"],"language":"kuery","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
