{"id":"7232f6b5-2139-4cc1-aaf3-cd188784fc9a","updated_at":"2026-07-01T15:17:49.600Z","updated_by":"elastic","created_at":"2026-07-01T15:17:49.600Z","created_by":"elastic","name":"[VN-SOC R13] URLhaus IOC Match — Threat Intel","tags":["VN-SOC-Lab","InitialAccess","T1189","IOC","ThreatIntel","URLhaus"],"interval":"1m","enabled":true,"revision":0,"description":"Detection rule using threat.indicator.provider tag added by Logstash translate filter (Pha 11 B3) — matches Apache request URL against URLhaus recent malicious URL feed (~5000 IOCs, refreshed daily via systemd timer).","risk_score":90,"severity":"critical","output_index":"","author":[],"false_positives":[],"from":"now-5m","rule_id":"e33f128f-b586-4bdd-a024-089c50075fb1","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1189","name":"Drive-by Compromise","reference":"https://attack.mitre.org/techniques/T1189/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["dvwa-apache-*"],"query":"threat.indicator.provider : \"urlhaus_recent\" and tags : \"ioc_match\"","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
