{"id":"9081f926-7cc7-4e7f-ab02-eb3a622d665c","updated_at":"2026-07-01T16:14:55.289Z","updated_by":"elastic","created_at":"2026-07-01T16:14:55.289Z","created_by":"elastic","name":"[VN-SOC R14] Wazuh FIM — Critical File/Registry Change","tags":["VN-SOC-Lab","Persistence","T1547.001","DefenseEvasion","T1562.001","FIM","Wazuh"],"interval":"1m","enabled":true,"revision":0,"description":"Fire khi Wazuh Agent syscheck detect thay đổi file / registry critical. Bao gồm rule id 550 (default FIM integrity change) + custom rules 100010-100016 (vn-soc-lab paths). Cover Windows Registry Run key + Startup folder + Linux /etc critical config.","risk_score":73,"severity":"high","output_index":"","author":[],"false_positives":[],"from":"now-5m","rule_id":"0f724537-7619-4097-9315-8c80d8f40b47","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1547.001","name":"Registry Run Keys / Startup Folder","reference":"https://attack.mitre.org/techniques/T1547/001/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0005","name":"Defense Evasion","reference":"https://attack.mitre.org/tactics/TA0005/"},"technique":[{"id":"T1562.001","name":"Disable or Modify Tools","reference":"https://attack.mitre.org/techniques/T1562/001/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["wazuh-alerts-*"],"query":"(rule.id : \"550\" OR rule.id : (\"100010\" OR \"100011\" OR \"100012\" OR \"100013\" OR \"100014\" OR \"100015\" OR \"100016\")) AND rule.level >= 7","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
