{"id":"215789bf-2815-4541-aafc-dd412996937e","updated_at":"2026-07-01T17:03:23.785Z","updated_by":"elastic","created_at":"2026-07-01T17:03:23.785Z","created_by":"elastic","name":"[VN-SOC R15] YARA Malware Detection — File Scan Match","tags":["VN-SOC-Lab","Malware","YARA","T1105","T1204"],"interval":"10m","enabled":true,"revision":0,"description":"YARA scanner match trên file critical (severity != test). Cover EICAR test + Reverse shell + LinPEAS + Metasploit payload + Web shell PHP + Ransomware note + Kali attack binaries. Systemd timer scan daily 03:30.","risk_score":90,"severity":"critical","output_index":"","author":[],"false_positives":[],"from":"now-30m","rule_id":"7f6958cd-fd83-45ac-bab9-cc48f40dbba2","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0002","name":"Execution","reference":"https://attack.mitre.org/tactics/TA0002/"},"technique":[{"id":"T1204","name":"User Execution","reference":"https://attack.mitre.org/techniques/T1204/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0011","name":"Command and Control","reference":"https://attack.mitre.org/tactics/TA0011/"},"technique":[{"id":"T1105","name":"Ingress Tool Transfer","reference":"https://attack.mitre.org/techniques/T1105/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["yara-scan-*"],"query":"yara.rule : * and NOT yara.severity : \"test\"","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
