{"id":"63c537f5-6d82-4f27-8533-e7f8bbdc160a","updated_at":"2026-07-01T17:08:31.928Z","updated_by":"elastic","created_at":"2026-07-01T17:08:31.928Z","created_by":"elastic","name":"[VN-SOC R16] Cowrie SSH Honeypot Interaction — Attacker Contact","tags":["VN-SOC-Lab","Reconnaissance","T1595","InitialAccess","T1110","Honeypot","Deception"],"interval":"1m","enabled":true,"revision":0,"description":"Cowrie SSH honeypot fires when unauthenticated actor attempts login on port 2222 (public). Any hit = adversary reconnaissance / bruteforce. Rule fire on: cowrie.login.success | cowrie.login.failed | cowrie.command.input (attacker typed command). Extract src_ip + credentials tried + commands.","risk_score":90,"severity":"critical","output_index":"","author":[],"false_positives":[],"from":"now-5m","rule_id":"9630e668-6980-47d0-845f-9fa038c9632e","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595","name":"Active Scanning","reference":"https://attack.mitre.org/techniques/T1595/"}]},{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["cowrie-*"],"query":"eventid : (\"cowrie.login.success\" OR \"cowrie.command.input\")","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
