{"id":"7d147735-b3ef-4261-9a64-82c5b00b2c0a","updated_at":"2026-07-01T17:39:48.725Z","updated_by":"elastic","created_at":"2026-07-01T17:39:48.725Z","created_by":"elastic","name":"[VN-SOC R18] Vulnerability Scanner — Critical/High CVE Discovered","tags":["VN-SOC-Lab","Vulnerability","T1190","T1195.002","CVE","Trivy","Nikto"],"interval":"30m","enabled":true,"revision":0,"description":"Trivy Docker image + filesystem scan (systemd timer daily 02:30) + Nikto web endpoint scan (weekly Sun 03:00) discover CVE severity HIGH/CRITICAL. Fire alert cho triage TheHive case auto-created via SOAR bridge. Cover T1190 exploit public-facing app + T1195.002 supply chain compromise of upstream image.","risk_score":90,"severity":"critical","output_index":"","author":[],"false_positives":[],"from":"now-2h","rule_id":"8ad283a1-f114-47b5-90e1-f408928fcc30","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0001","name":"Initial Access","reference":"https://attack.mitre.org/tactics/TA0001/"},"technique":[{"id":"T1190","name":"Exploit Public-Facing Application","reference":"https://attack.mitre.org/techniques/T1190/"},{"id":"T1195","name":"Supply Chain Compromise","reference":"https://attack.mitre.org/techniques/T1195/"}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["vuln-scan-*"],"query":"vuln.severity : (\"CRITICAL\" OR \"HIGH\") AND event.module : (\"trivy\" OR \"nikto\")","actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
