{"id":"dbc9c2f0-1a12-4ecc-bd9f-3dd52ff91315","updated_at":"2026-06-27T03:25:27.274Z","updated_by":"elastic","created_at":"2026-06-25T10:10:19.530Z","created_by":"elastic","name":"[VN-SOC R2] LSASS Memory Access","tags":["VN-SOC-Lab","CredentialAccess","T1003.001","LSASS"],"interval":"1m","enabled":true,"revision":1,"description":"Phát hiện process bất kỳ mở handle vào lsass.exe với access mask nguy hiểm (PROCESS_VM_READ, PROCESS_VM_WRITE, ALL_ACCESS). Đặc trưng của T1003.001 OS Credential Dumping — dump LSASS memory để lấy plain-text password, NTLM hash, Kerberos ticket. Tools điển hình: Mimikatz (sekurlsa::logonpasswords), ProcDump -ma, Cobalt Strike beacon mimikatz module.","risk_score":90,"severity":"critical","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"211b40f5-f702-4558-ab36-390daa749194","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1003","name":"OS Credential Dumping","reference":"https://attack.mitre.org/techniques/T1003/","subtechnique":[{"id":"T1003.001","name":"LSASS Memory","reference":"https://attack.mitre.org/techniques/T1003/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: \"10\" AND\nwinlog.provider_name: \"Microsoft-Windows-Sysmon\" AND\nwinlog.event_data.TargetImage.keyword: *\\\\lsass.exe AND\nwinlog.event_data.GrantedAccess: (\n  \"0x1010\" OR\n  \"0x1410\" OR\n  \"0x1438\" OR\n  \"0x143a\" OR\n  \"0x1fffff\" OR\n  \"0x1f1fff\"\n)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
