{"id":"32789613-2da1-4705-860b-06094bfbfe79","updated_at":"2026-06-27T03:26:04.317Z","updated_by":"elastic","created_at":"2026-06-25T10:14:08.627Z","created_by":"elastic","name":"[VN-SOC R3] Registry Run Key Modification","tags":["VN-SOC-Lab","Persistence","T1547.001","RunKey"],"interval":"1m","enabled":true,"revision":2,"description":"Phát hiện sự kiện set value (Sysmon event_id 13) vào registry key Run hoặc RunOnce thuộc HKLM hoặc HKCU. Đây là cơ chế persistence đơn giản và phổ biến nhất trên Windows — T1547.001. Bất kỳ value mới được ghi vào sẽ chạy mỗi lần user logon / boot. Không cần Administrator (HKCU writable bởi user-context). Malware dùng vì Defender không alert mặc định nếu target chưa biết.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"6485119c-323f-4af6-a32e-f7d8afe6834d","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0003","name":"Persistence","reference":"https://attack.mitre.org/tactics/TA0003/"},"technique":[{"id":"T1547","name":"Boot or Logon Autostart Execution","reference":"https://attack.mitre.org/techniques/T1547/","subtechnique":[{"id":"T1547.001","name":"Registry Run Keys / Startup Folder","reference":"https://attack.mitre.org/techniques/T1547/001/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: \"13\" AND\nwinlog.provider_name: \"Microsoft-Windows-Sysmon\" AND\nwinlog.event_data.TargetObject.keyword: (\n  *\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run\\\\* OR\n  *\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\RunOnce\\\\*\n)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
