{"id":"75515d5b-43b5-426a-8faf-9ebe71c8c3a6","updated_at":"2026-06-27T03:27:08.386Z","updated_by":"elastic","created_at":"2026-06-25T10:19:59.774Z","created_by":"elastic","name":"[VN-SOC R4] Multiple Failed Logon — Brute Force","tags":["VN-SOC-Lab","CredentialAccess","T1110","BruteForce"],"interval":"1m","enabled":true,"revision":3,"description":"Threshold rule: phát hiện ≥5 lần đăng nhập fail (Security event 4625) cùng 1 TargetUserName trong cửa sổ 5 phút. Đặc trưng của brute-force password — T1110. Source phổ biến: external RDP (Internet expose), SMB/NTLM relay LAN, local console insider.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"7f045e5a-262b-4fa1-8bf6-cbb410cc0f1f","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0006","name":"Credential Access","reference":"https://attack.mitre.org/tactics/TA0006/"},"technique":[{"id":"T1110","name":"Brute Force","reference":"https://attack.mitre.org/techniques/T1110/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"threshold","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*"],"query":"event.code: \"4625\" AND winlog.channel: \"Security\"","filters":[],"threshold":{"field":["winlog.event_data.TargetUserName.keyword"],"value":5,"cardinality":[]},"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
