{"id":"69bcbdd5-aa6c-4a66-b849-2e25af852083","updated_at":"2026-06-27T03:26:31.337Z","updated_by":"elastic","created_at":"2026-06-27T03:11:31.871Z","created_by":"elastic","name":"[VN-SOC R6] Network Scan Detection","tags":["VN-SOC-Lab","Reconnaissance","T1595","Suricata"],"interval":"1m","enabled":true,"revision":1,"description":"Phát hiện activity scan từ Suricata IDS — nmap, masscan, hoặc ET SCAN signatures khác. T1595 Active Scanning là phase đầu của hầu hết external attack — detect sớm = cơ hội block attacker IP trước khi họ pivot sang exploit phase.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"963f3c48-7c04-43f7-8428-e33e499a1aeb","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595","name":"Active Scanning","reference":"https://attack.mitre.org/techniques/T1595/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*","suricata-*"],"query":"event_type: \"alert\" AND\nalert.category: (\n  \"Attempted Information Leak\" OR\n  \"Misc activity\" OR\n  \"Web Application Attack\" OR\n  \"Potentially Bad Traffic\"\n) AND\nalert.signature: (\n  *SCAN* OR\n  *Nmap* OR\n  *masscan* OR\n  *Recon* OR\n  *probe* OR\n  *enum*\n)","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
