{"id":"4c78d1d7-44a3-4596-a2b1-26e5f59af27a","updated_at":"2026-06-27T03:50:27.944Z","updated_by":"elastic","created_at":"2026-06-27T03:14:35.951Z","created_by":"elastic","name":"[VN-SOC R7] Suspicious User-Agent — Web Attack Tool","tags":["VN-SOC-Lab","Reconnaissance","T1595.002","WebAttack"],"interval":"1m","enabled":true,"revision":3,"description":"Phát hiện HTTP request với User-Agent string đặc trưng của automated web attack tools (sqlmap, nikto, nmap NSE, gobuster, nuclei, ...). T1595.002 Vulnerability Scanning. Severity cao vì sqlmap/wpscan đã sang attack stage, không phải recon thuần.","risk_score":73,"severity":"high","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"d470ff8a-3c7c-4054-82d8-1ed9adb17a78","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0043","name":"Reconnaissance","reference":"https://attack.mitre.org/tactics/TA0043/"},"technique":[{"id":"T1595","name":"Active Scanning","reference":"https://attack.mitre.org/techniques/T1595/","subtechnique":[{"id":"T1595.002","name":"Vulnerability Scanning","reference":"https://attack.mitre.org/techniques/T1595/002/"}]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*","dvwa-apache-*"],"query":"user_agent.original: (\n    *sqlmap* OR\n    *nikto* OR             \n    *nmap* OR\n    *masscan* OR\n    *hydra* OR             \n    *nuclei* OR\n    *gobuster* OR\n    *dirbuster* OR\n    *zgrab* OR\n    *wpscan*\n  )","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
