{"id":"37e825d6-631f-48d6-9fd4-1a450e631d57","updated_at":"2026-06-27T03:50:51.959Z","updated_by":"elastic","created_at":"2026-06-27T03:17:47.029Z","created_by":"elastic","name":"[VN-SOC R8] Sensitive File Path Probe","tags":["VN-SOC-Lab","Discovery","T1083","WebAttack"],"interval":"1m","enabled":true,"revision":2,"description":"Phát hiện HTTP request probe các path nhạy cảm (config file, admin panel, backup, system file). T1083 File and Directory Discovery. Attacker recon path nhạy cảm trước khi exploit. Cảnh báo sớm cho phép block IP trước khi attacker tìm thấy file/folder bị expose.","risk_score":47,"severity":"medium","license":"","output_index":"","meta":{"kibana_siem_app_url":"http://43.228.215.234:5601/app/security"},"author":[],"false_positives":[],"from":"now-2m","rule_id":"4909064e-97bd-4398-a661-b99c6bfb3774","max_signals":100,"risk_score_mapping":[],"severity_mapping":[],"threat":[{"framework":"MITRE ATT&CK","tactic":{"id":"TA0007","name":"Discovery","reference":"https://attack.mitre.org/tactics/TA0007/"},"technique":[{"id":"T1083","name":"File and Directory Discovery","reference":"https://attack.mitre.org/techniques/T1083/","subtechnique":[]}]}],"to":"now","references":[],"version":1,"exceptions_list":[],"immutable":false,"rule_source":{"type":"internal"},"related_integrations":[],"required_fields":[],"setup":"","type":"query","language":"kuery","index":["apm-*-transaction*","auditbeat-*","endgame-*","filebeat-*","logs-*","packetbeat-*","traces-apm*","winlogbeat-*","-*elastic-cloud-logs-*","dvwa-apache-*"],"query":"  url.original.keyword: (\n    *.env* OR\n    *.git* OR              \n    *wp-config* OR\n    *config.php* OR\n    *admin* OR\n    *phpmyadmin* OR\n    *wp-admin* OR\n    *manager/html* OR\n    *backup* OR            \n    *passwd* OR\n    *.bak* OR\n    *.old* OR\n    *webshell* OR\n    *c99.php* OR\n    *r57.php*\n  )","filters":[],"actions":[]}
{"exported_count":1,"exported_rules_count":1,"missing_rules":[],"missing_rules_count":0,"exported_exception_list_count":0,"exported_exception_list_item_count":0,"missing_exception_list_item_count":0,"missing_exception_list_items":[],"missing_exception_lists":[],"missing_exception_lists_count":0,"exported_action_connector_count":0,"missing_action_connection_count":0,"missing_action_connections":[],"excluded_action_connection_count":0,"excluded_action_connections":[]}
